In [7]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\juank\anaconda3\envs\dev\lib\site-packages (2.0.1)

In [8]:
import numpy as np
import pandas as pd

In [9]:
dfSurvivals = pd.read_excel("dataset/titanic3.xls", index_col=None)

In [10]:
dfSurvivals.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [11]:
dfSurvivals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [12]:
(dfSurvivals.isnull() | dfSurvivals.empty | dfSurvivals.isna()).sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [13]:
def showPercentageNan(colName, dtFrame):
    perc = (dtFrame[colName].isnull().sum() / dtFrame.shape[0])
    print(f"Percent of missing ''{colName}'' records is {round(perc * 100,3)} %")

In [15]:
colNan = [ "age",
    "fare",
    "cabin",
    "embarked",
    "boat",
    "body",
    "home.dest"
]

for col in colNan:
    showPercentageNan(col, dfSurvivals)

Percent of missing ''age'' records is 20.092 %
Percent of missing ''fare'' records is 0.076 %
Percent of missing ''cabin'' records is 77.464 %
Percent of missing ''embarked'' records is 0.153 %
Percent of missing ''boat'' records is 62.872 %
Percent of missing ''body'' records is 90.756 %
Percent of missing ''home.dest'' records is 43.086 %

In [16]:
dfSurvivals.drop(["cabin","boat","body","home.dest"], axis=1, inplace=True)

In [17]:
dfSurvivals.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S

In [18]:
dfSurvivals.drop("name", axis=1, inplace=True)

In [19]:
dfSurvivals.head()

   pclass  survived     sex      age  sibsp  parch  ticket      fare embarked
0       1         1  female  29.0000      0      0   24160  211.3375        S
1       1         1    male   0.9167      1      2  113781  151.5500        S
2       1         0  female   2.0000      1      2  113781  151.5500        S
3       1         0    male  30.0000      1      2  113781  151.5500        S
4       1         0  female  25.0000      1      2  113781  151.5500        S

In [20]:
count_unique_fares = dfSurvivals['fare'].nunique()

In [25]:
count_unique_fares

281